'''
    Здесь будут различные советы
'''

'''
    Здесь будут примеры
'''
'''
(А. Калинин) Текстовый файл 24-215.txt содержит строку из символов A, B, C и цифр 1, 2, 3, всего не более чем 10**6 символов.
Определите максимальное количество идущих подряд троек символов вида «цифра + цифра + буква».
'''
file = open('24data/24-215.txt').readlines()
print(file)


'''
    Здесь будут сложные задачки, которые нужно решить
'''
